Revit 2027 API
DividedPath.IsValidFixedNumberOfPoints Method
 Identifies if the indicated number of points is valid for assignment to a DividedPath with a layout type 'FixedNumber'.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidFixedNumberOfPoints(
	int fixedNumberOfPoints
)
Public Shared Function IsValidFixedNumberOfPoints (
	fixedNumberOfPoints As Integer
) As Boolean
public:
static bool IsValidFixedNumberOfPoints(
	int fixedNumberOfPoints
)
static member IsValidFixedNumberOfPoints :
        fixedNumberOfPoints : int -> bool
Parameters
fixedNumberOfPoints Int32
Return Value
Boolean
See Also
Reference
DividedPath Class
Autodesk.Revit.DB Namespace